tobozo/ESP32-Chimera-Core/src/drivers/ESP32-S3-Box/Audio/src/bsp_i2s.c
/*
 * SPDX-FileCopyrightText: 2015-2022 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */

// attempt to detect esp-idf version
#if __has_include(<esp_idf_version.h>)
  #include <esp_idf_version.h>
#endif

//   #error "Invalid esp-idf version (expected: >=4.4.0)"
// #endif
// #else
//   #if defined ESP_IDF_VERSION && ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 4, 0)

// esp32-2.0.0 and previous don't have the guts to handle this
#if defined ESP_IDF_VERSION_VAL && ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 4, 0) // only after >=4.4.0

  #include "bsp_board.h"
  #include "bsp_i2s.h"
  #include "driver/gpio.h"
  #include "driver/i2s.h"
  #include "esp_err.h"
  #include "esp_log.h"
  #include "freertos/FreeRTOS.h"

  /* Required for I2S driver workaround */
  #include "esp_rom_gpio.h"
  #include "hal/gpio_hal.h"
  //#include "hal/i2s_ll.h"

  #define I2S_CONFIG_DEFAULT() { \
      .mode                   = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_TX | I2S_MODE_RX), \
      .sample_rate            = sample_rate, \
      .bits_per_sample        = I2S_BITS_PER_SAMPLE_16BIT, \
      .channel_format         = I2S_CHANNEL_FMT_RIGHT_LEFT, \
      .communication_format   = I2S_COMM_FORMAT_STAND_I2S, \
      .intr_alloc_flags       = ESP_INTR_FLAG_LEVEL1, \
      .dma_buf_count          = 6, \
      .dma_buf_len            = 160, \
      .use_apll               = false, \
      .tx_desc_auto_clear     = true, \
      .fixed_mclk             = 0, \
      .mclk_multiple          = I2S_MCLK_MULTIPLE_DEFAULT, \
      .bits_per_chan          = I2S_BITS_PER_CHAN_16BIT, \
  }



  esp_err_t bsp_i2s_init(i2s_port_t i2s_num, uint32_t sample_rate)
  {
      esp_err_t ret_val = ESP_OK;
      const board_res_desc_t *brd = bsp_board_get_description();

      i2s_config_t i2s_config = I2S_CONFIG_DEFAULT();

      i2s_pin_config_t pin_config =
      {

        .bck_io_num   = brd->GPIO_I2S_SCLK,
        .ws_io_num    = brd->GPIO_I2S_LRCK,
        .data_out_num = brd->GPIO_I2S_DOUT,
        .data_in_num  = brd->GPIO_I2S_SDIN,
        .mck_io_num   = brd->GPIO_I2S_MCLK
      };

      ret_val |= i2s_driver_install(i2s_num, &i2s_config, 0, NULL);
      ret_val |= i2s_set_pin(i2s_num, &pin_config);
      ret_val |= i2s_zero_dma_buffer(i2s_num);

      return ret_val;
  }

  esp_err_t bsp_i2s_deinit(i2s_port_t i2s_num)
  {
      esp_err_t ret_val = ESP_OK;

      ret_val |= i2s_stop(I2S_NUM_0);
      ret_val |= i2s_driver_uninstall(i2s_num);

      return ret_val;
  }


#endif
